In [1]:
import pandas as pd
df = pd.read_csv('./salary.csv',usecols=[1, 2, 3, 4, 5])

In [2]:
df.head()

,Rank,Major,Degree Type,Early Career Pay,Mid-Career Pay
0,1,Petroleum Engineering,Bachelors,97500,212500
1,2,Operations Research & Industrial Engineering,Bachelors,98300,191800
2,3,Interaction Design,Bachelors,74700,173600
3,4,Applied Economics and Management,Bachelors,76500,164400
4,5,Building Science,Bachelors,69000,163100

In [3]:
df.shape

(799, 5)

In [4]:
df.columns

Index(['Rank', 'Major', 'Degree Type', 'Early Career Pay', 'Mid-Career Pay'], dtype='object')

In [5]:
df.dtypes

Rank                 int64
Major               object
Degree Type         object
Early Career Pay     int64
Mid-Career Pay       int64
dtype: object

In [6]:
lowest_paying = df.sort_values('Early Career Pay', ascending=True)
lowest_paying[['Major', 'Early Career Pay']].head()

                        Major  Early Career Pay
767             Voice & Opera             38700
576    Painting & Printmaking             39300
794            Equine Studies             40300
785  Mental Health Counseling             40600
745   Rehabilitation Services             41300

In [7]:
lowest_paying = df.sort_values('Mid-Career Pay', ascending=True)
lowest_paying[['Major', 'Mid-Career Pay']].head()

                         Major  Mid-Career Pay
798              Metalsmithing           44900
797  Early Childhood Education           50600
796   Nonprofit Administration           52100
795      Addictions Counseling           52200
794             Equine Studies           52500

**Highest Early Career Paying Majors**

In [8]:
highest_paying = df.sort_values('Early Career Pay', ascending=False)
highest_paying[['Major', 'Early Career Pay']].head(10)

                                            Major  Early Career Pay
56                    Physician Assistant Studies            109600
1    Operations Research & Industrial Engineering             98300
0                           Petroleum Engineering             97500
117          Nuclear Engineering Technology (NET)             92500
6                             Operations Research             92200
60                      Metallurgical Engineering             90800
25            Computer Science (CS) & Engineering             90500
23                      Computer Engineering (CE)             89100
107                                      Medicine             88700
10                     Aeronautics & Astronautics             88200

**Highest Mid-Career Paying Majors**

In [9]:
highest_paying = df.sort_values('Mid-Career Pay', ascending=False)
highest_paying[['Major', 'Mid-Career Pay']].head(10)

                                          Major  Mid-Career Pay
0                         Petroleum Engineering          212500
1  Operations Research & Industrial Engineering          191800
2                            Interaction Design          173600
3              Applied Economics and Management          164400
4                              Building Science          163100
5                         Actuarial Mathematics          160000
6                           Operations Research          160000
7                           Systems Engineering          159100
8                 Optical Science & Engineering          158300
9                Information & Computer Science          157800